<?
/*=================================================================
新貿易版箱庭諸国用　同盟管理システム
hako-ally.php v0.1
=================================================================*/

//-----------------------------------------------------------------
define("READ_LINE", 1024);
$GAME_TOP = $init->baseDir . "/hako-main.php";
$THIS_FILE = $init->baseDir . "/hako-ally.php";
$BACK_TO_TOP = "<a href=\"{$GAME_TOP}?\">{$init->tagBig_}ゲームへ戻る{$init->_tagBig}</a>、<A HREF=\"{$THIS_FILE}?\">{$init->tagBig_}同盟トップへ戻る{$init->_tagBig}</A>";
//-----------------------------------------------------------------

//=================================================================
class HtmlAlly extends HTML {
  //--------------------------------------------------
  // 初期画面
  //--------------------------------------------------
  function allyTop($hako) {
    global $init;
    print "<h2>同盟管理システム</h2>\n";
    if($init->allyUse) {
      print <<<END
<h3>各同盟の状況</h3>
END;
    }
	$this->allyinfo($hako);
  }
  //--------------------------------------------------
  // 同盟の状況
  //--------------------------------------------------
  function allyInfo() {
  $param['test'] = "test";
  print HTML::tplengine('./templates/ally.html',$param);
}
  //--------------------------------------------------
  // 同盟の情報
  //--------------------------------------------------
  function amityOfAlly() {

}
  //--------------------------------------------------
  // 同盟の結成
  //--------------------------------------------------
  function newAllyTop() {

}


}
?>